{
  "name": "Seals and their functions",
  "icon": "soulbound:blank_attack_seal",
  "category": "soulbound:seals",
  "pages": [
    {
      "type": "patchouli:spotlight",
      "item": "soulbound:blank_passive_seal",
      "link_recipe": true,
      "text": "The Blank Passive Seal is the Base for All Other Passive Seals."
    },
    {
      "type": "patchouli:spotlight",
      "item": "soulbound:blank_attack_seal",
      "title": "Blank Offensive Seal",
      "link_recipe": true,
      "text": "The Blank Offensive Seal is the Base for All Other Offensive Seals."
    },
    {
      "type": "patchouli:spotlight",
      "item": "soulbound:blank_amplifying_seal",
      "link_recipe": true,
      "text": "The Blank Amplifying Seal is the Base for All Other Amplifying Seals."
    },
    {
      "type": "patchouli:spotlight",
      "item": "soulbound:axing_seal",
      "link_recipe": true,
      "text": "The Axing Seal is an Offensive Seal, which does high attack damage, but has low swing speed. It's damage, swing speed, mining speed, and looting can be upgraded with amplifying seals. It can be used to strip logs and mine wood faster."
    },
    {
      "type": "patchouli:spotlight",
      "item": "soulbound:pickaxing_seal",
      "link_recipe": true,
      "text": "The Pickaxing Seal is a Passive Seal, which does low attack damage but has high swing speed. Amplifying seals can upgrade mining speed, vein mine, area mine, fortune, and silk touch. It can mine stone blocks quicker."
    },
    {
      "type": "patchouli:spotlight",
      "item": "soulbound:hoeing_seal",
      "link_recipe": true,
      "text": "The Hoeing Seal is a Passive Seal, which does no attack damage but has high swing speed. Amplifying seals can upgrade harvest aoe, replant aoe, and till dirt aoe. It can mine leaf and hay blocks quicker and till dirt"
    },
    {
      "type": "patchouli:spotlight",
      "item": "soulbound:swording_seal",
      "link_recipe": true,
      "text": "The Hoeing Seal is an Offensive Seal, which does medium attack damage and has medium swing speed. Amplifying seals can upgrade its looting, swing speed, damage, and aoe when attacking."
    }
  ]
}